{
  "title": "UI/UX Design Trends 2023",
  "byline": "Codeart",
  "dir": null,
  "lang": "en",
  "content": {},
  "textContent": "\n                                    \n                                    \n                                      \n                                    \n                                    \n                                      Yet another year is coming to a close. Many of the\n                                      2022 trends\n                                      we anticipated, did find their use in digital products across\n                                      our devices this year. As we are about to welcome 2023, we are\n                                      taking a more careful look at both\n                                      UI and UX trends that continue to evolve,\n                                      take new shape and find novel uses to the user’s benefit and\n                                      delight. In this article, we highlight some of the trends we\n                                      think will persist and perhaps gain even more traction in the\n                                      next year.\n                                    \n                                    \n                                      UI Trends\n                                    \n                                    \n                                      1. Motion Design\n                                    \n                                    \n                                      \n                                      \n                                        Motion design example for\n                                        iPad Mini by Apple\n                                      \n                                    \n                                    \n                                      Motion design is becoming an integral part of interface\n                                      design. The continual evolution of animation and video\n                                      compression, paired with the increasing capacities of the\n                                      internet, browsers and devices, has allowed more\n                                      complex and nuanced motion in interfaces without\n                                        sacrificing speed or efficiency.\n                                    \n                                    \n                                      With the presence of intuitive animation programs and\n                                      animation libraries, designers are feeling more confident to\n                                      experiment with motion for a more\n                                      dynamic and visually appealing experience. Mimicking the momentum and physics of physical products,\n                                      designers will be able to create\n                                      ever-so-immersive modes of digital interactivity.\n                                    \n                                    \n                                      Moving forward, motion will continue growing its presence\n                                      through video content as well.\n                                      Curated video snippets, dynamic backgrounds and quirky\n                                        video popups\n                                      will become even more integral — if not essential — in\n                                      creating captivating brand experiences.\n                                    \n                                    \n                                      2. Scrollytelling\n                                    \n                                    \n                                      \n                                      \n                                        Scrollytelling example by\n                                        Mr.Pops\n                                      \n                                    \n                                    \n                                      One subset of motion design that deserves close attention is\n                                      scrollytelling or immersive scrolling. In a similar fashion to\n                                      other animation and micro-interactions, scrollytelling is\n                                      becoming increasingly prominent in\n                                      enriching the interaction between users and\n                                        products.\n                                    \n                                    \n                                      Scroll trigger animation has perhaps less\n                                      to do with the product’s utility than other types of\n                                      animation, but when done right, it adds unmatched visual\n                                      appeal and effective transitions between different sets of\n                                      information. The storytelling capabilities of immersive\n                                      scrolling, allow products and particularly landing page\n                                      designs to come to life,\n                                      despite more limited content and functionality. In short,\n                                      scrollytelling provides a type of narration that\n                                      elevates the content, delights users, improves brand\n                                        perception and drives desirability. It is a new way of storytelling that is only just beginning\n                                      to evolve through the countless explorations we see on the\n                                      internet.\n                                    \n                                    \n                                      \n                                      \n                                        Scrollytelling example by\n                                        Bloom.xyz\n                                      \n                                    \n                                    \n                                      3. New Bolder Minimalism\n                                    \n                                    \n                                      \n                                      \n                                        Modern Minimalism example:\n                                        Solar Sky\n                                        Website by Herdetya Priambodo from Plainthing Studio via\n                                        Dribble\n                                      \n                                    \n                                    \n                                      Very little is novel about the direction in which minimalism\n                                      is going next — at least at first glance. All the essential\n                                      elements of minimalism are there:\n                                      focus on\n                                      functional objects without un-functional decor,\n                                      unobstructed negative space, flat elements and patterns,\n                                        easy navigation and limited color palettes. What makes the upcoming minimalism trend different is more\n                                      nuanced and evolved take on the existing concept.\n                                    \n                                    \n                                      Carefully curated monochromatic palettes\n                                      will be key to creating a modern minimal look. Combined with\n                                      large flat color shapes, substantial padding and rounded\n                                      edges, they result in decluttered but overall ‘rich’\n                                      interfaces. Elements will maintain a rounded and soft look,\n                                      combined with flat graphics and contrasting types. Going into\n                                      next year, minimalist interfaces will certainly\n                                      enable more personalized and expressive experiences\n                                        without sacrificing clarity, readability and easy\n                                        navigation.\n                                    \n                                    \n                                      \n                                    \n                                    \n                                      4. Happy Colors / Dopamine inducing palettes\n                                    \n                                    \n                                      \n                                      \n                                        Use of happy colors example: Solomia Kravets for Gecko\n                                        Dynamics via\n                                        Dribble\n                                      \n                                    \n                                    \n                                      What is becoming known as\n                                      ‘dopamine dressing’\n                                      predominantly in fashion, builds off of the retro comeback of\n                                      recent years and centers around the symbolic qualities of bold\n                                      and happy hues. Interfaces are not immune to this trend, as it\n                                      continues to evolve and redefine the ground rules for personal\n                                      and brand expression.\n                                      Color blocking, mild textures and therapeutic hues\n                                      combined with\n                                      retro elements and superimposed on brutalist and even\n                                        anti-design layouts will make bold statements to users from\n                                      the 70s all the way to gen Z.\n                                    \n                                    \n                                      These bursts of dopamine are proliferating so much that even\n                                      huge brands are taking notice. Despite otherwise more\n                                      toned-down brand aesthetics, consumer goods giants choose to\n                                      dress (digital) campaigns in dopamine colors as standalone\n                                      initiatives\n                                      without having to revamp their core brand.\n                                    \n                                    \n                                      5. Aurora Gradients\n                                    \n                                    \n                                      \n                                      \n                                        Creative aurora gradients example:\n                                        The Engine\n                                        Website\n                                      \n                                    \n                                    \n                                      If you thought that after the Instagram redesign the gradient\n                                      trend would slowly come to an end, you were wrong.\n                                      Gradients are not going anywhere, they are just changing\n                                        the vibe.\n                                    \n                                    \n                                      Dopamine-inducing palettes can come in color blocks and as\n                                      increasingly popularized in recent years, they can blend to\n                                      create eye-catching gradients. Also known as\n                                      aurora gradients, these bold\n                                      color schemes pair light complementaries to offer ethereal and\n                                      contemporary moods that subtly continue to\n                                      reference the 80s and 90s. This\n                                      is by no means a new trend, but certainly, one that keeps\n                                      expanding and finding itself in brand and web assets across a\n                                      range of industries beyond just tech.\n                                    \n                                    \n                                      The name comes from their resemblance to the Aurora Borealis,\n                                      also known as Northern Lights. Mixing compatible colors into\n                                      an aurora gradient for web and app design projects, makes the\n                                      whole design look\n                                      elevated, mystical, expressive and smooth.\n                                    \n                                    \n                                      UX Trends\n                                    \n                                    \n                                      1. Cross-device experience\n                                    \n                                    \n                                      \n                                    \n                                    \n                                      Customers have grown accustomed to the cross-device\n                                      operability offered by today’s applications. With Apple’s\n                                      product offering paving the way for immersive product\n                                      ecosystems, users have made evident their expectations\n                                      for\n                                        seamless cross-device activity.\n                                      Many products will continue taking the cue throughout the\n                                      coming year in making their digital products as device\n                                      agnostic as possible, while also providing a consistent and\n                                      reliable experience in real-time.\n                                    \n                                    \n                                      Beyond just being a habit-turned-expectation, users certainly\n                                      have new and\n                                      valuable uses for this kind of flexibility. UX researchers and engineers alike will be tasked with\n                                      improving the seamlessness of existing cross-device\n                                      experiences by considering edge cases and unusual maneuvers\n                                      along the user journey of specific products and across various\n                                      devices. More importantly, they will face the harder challenge\n                                      of closely looking for new opportunities that answer\n                                      legitimate user needs and pain points in this context.\n                                    \n                                    \n                                      2. Emotional design\n                                    \n                                    \n                                      \n                                      \n                                        Motivational messages after all tasks are finished in\n                                        Clickup\n                                      \n                                    \n                                    \n                                      Emotional design has existed for as long as UX research has\n                                      altogether. The term highlights the fact that humans base\n                                      their decisions\n                                      on emotions rather than logic.\n                                      With the maturation of digital experiences, we are witnessing\n                                      a digital product saturation where novelty and usability won’t\n                                      be enough to stand out. In turn, a renewed focus on emotional\n                                      design will continue to play an instrumental role in\n                                      creating\n                                        valuable product differentiators and giving a competitive\n                                        edge.\n                                    \n                                    \n                                      To practice and achieve new advances in emotional design, UX\n                                      researchers will have to employ\n                                        deeper research into the emotional needs and expectations of\n                                        users in day-to-day interactions. Explorations will hope to point to types of interaction\n                                      that elicit strong and positively affirming, as well as\n                                      visceral and behavioral responses\n                                      before more highly cognitive impressions are made. Specific\n                                      areas such as\n                                      micro-gestures, tolerability, relatable micro-copy and\n                                        personalization\n                                      will go hand in hand with the research in order to make way\n                                      for outstanding products.\n                                    \n                                    \n                                      3. (Hyper) Personalization\n                                    \n                                    \n                                      \n                                      \n                                        Our design for the Lexi Smart\n                                        Home Mobile App\n                                      \n                                    \n                                    \n                                      Within emotional design, we expect to see a greater focus on\n                                      personalization as a way to maintain and solidify the\n                                        relationship between users and products.\n                                      Whether it is a personal health app, a smart home system, or a\n                                      personal task manager (to name a very few), researching new\n                                      ways to provide\n                                      personalised system feedback will be essential.\n                                    \n                                    \n                                      This will likely depend on new types of data collection that\n                                      can then feed into daily user-to-system interactions. For this\n                                      to be possible, UX researchers and engineers will have to\n                                      expand their considerations about what kinds of\n                                      contextual data can be (consensually) collected to\n                                        establish deeper and of course more beneficial\n                                        relationships. Such research might also delve into the\n                                      capabilities of IoT systems, to\n                                      be able to achieve more seamless and personalized digital\n                                      experiences.\n                                    \n                                    \n                                      4. Micro-interactions\n                                    \n                                    \n                                      \n                                      \n                                        Link hover micro-interaction example by\n                                        Aaron Iker via Dribble\n                                      \n                                    \n                                    \n                                      Micro-interactions will continue to be the focus of UX\n                                      research in an effort to increase the fidelity of\n                                      human-computer interaction,\n                                      for purposes beyond emotional design and UI delight. Although they pertain to UI decisions in later stages of a\n                                      project, core micro-interaction concepts will continue to\n                                      depend on an intimate understanding of the process flow as\n                                      well as\n                                      how user — and system-triggered micro-interactions result\n                                        in system feedback. Moreover, looking into user psychology,\n                                      mental mapping and physical product precedents\n                                      will potentially reveal new opportunities for\n                                      well-designed and intuitive system feedback.\n                                    \n                                    \n                                      \n                                      \n                                        Login flow micro-interactions example by\n                                        Jakub Antalik via Dribble\n                                      \n                                    \n                                    \n                                      *Honourable mention\n                                    \n                                    \n                                      Sustainability in tech\n                                    \n                                    \n                                      \n                                      \n                                        Illustration by\n                                        Magda Azab via Dribble\n                                      \n                                    \n                                    \n                                      Sustainability at its core means meeting our current needs\n                                      without compromising the ability of future generations to\n                                        meet their own. Achieving sustainability is essential in not only preventing\n                                      future environmental degradation but also in maintaining (and\n                                      in fact improving)\n                                      the quality of life in environmental, social and economic\n                                        terms.\n                                    \n                                    \n                                      We recognize the fact that the industry we are in perpetuates\n                                      in part unsustainable habits. We also recognize our shared\n                                      responsibility as architects of the digital space to\n                                      advocate for and integrate sustainability into the everyday\n                                        user experience.\n                                      This includes disseminating contextual and actionable\n                                      information thru\n                                      clear language and interface elements, in order to elicit environmentally and socially conscious\n                                      decisions from users and consumers.\n                                    \n                                    \n                                      Since misinformation (greenwashing) leads\n                                      to skeptical and dissuaded customers, it is essential that we\n                                      present\n                                      green efforts in a transparent and honest manner, even when that includes the shortcomings our product\n                                      offering faces along the way.\n                                    \n                                    \n                                      Besides facilitating conversations around sustainable user\n                                      choices, there are other ways we UI/UX designers can\n                                      contribute to the complex challenge of sustainability. There\n                                      is an increasing number of ambitious tech spaces out there\n                                      tackling issues such as climate change, food scarcity, waste\n                                      and overconsumption to name a few. Designing intuitive user\n                                      experiences for these technologies will be crucial for their\n                                      success and a great way to partake in the sustainability\n                                      movement. Even more directly than that, we can always\n                                        participate by starting conversations about sustainability practices at our place of work. Be it\n                                      the IT infrastructure and its environmental footprint, the\n                                      choice of hosting services, or as little as the office’s green\n                                      efforts, opportunities for positive impact exist at every\n                                      level and scale.\n                                    \n                                  \n                                    \n                                      UI and UX trends will continue to evolve. Beyond just\n                                      answering current user needs, UI and UX will have the lasting\n                                      task of\n                                      anticipating, exploring and addressing newfound user pain\n                                        points and expectations. With the fast-paced integration of technology into our\n                                      daily lives, these trends represent but a tiny facet of this\n                                      ongoing task. Be sure to use them to guide your UI and UX\n                                      work, but certainly\n                                      feel empowered to push beyond\n                                      in taking human-computer interaction an extra step further\n                                      towards a more\n                                      helpful, intuitive and delightful experience.\n                                    \n                                    \n                                      Written by Maja Mitrovikj& Andrej Blazhevski UI/UX Designers at Codeart.\n                                    \n                                    \n                                      \n                                    \n                                  ",
  "length": 27336,
  "excerpt": "Yet another year is coming to a close. Many of the 2022 trends we anticipated, did find their use in digital products across our devices…",
  "siteName": "Medium"
}